app/controllers/admin/campanha_agentes_controller.rb

SELECT * FROM `campanha_agentes`
---
  def index
    @campanha_agentes = CampanhaAgente.all