app/controllers/admin/campanha_relacao_controller.rb

  def index
    @campanhas = Campanha.all
---
SELECT * FROM `campanhas`