app/controllers/admin/campanhas_controller.rb

  def index
    @campanha = Campanha.new
    @campanhas = Campanha.paginate :page => params[:page], :per_page=>5, :order => 'created_at DESC'
---
SELECT * FROM `campanhas` ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `campanhas`

  def edit
    @campanha = Campanha.find(params[:id])
    @campanhas = Campanha.all
---
SELECT * FROM `campanhas` WHERE (`campanhas`.`id` = 3)
SELECT * FROM `campanhas`

  def create
   @campanha = Campanha.new(params[:campanha])

   respond_to do |format|
     if @campanha.save
---
INSERT INTO `campanhas` (`created_at`, `data_termino`, `titulo`, `updated_at`, `data_troca`, `data_inicio`, `regulamento`) VALUES('2009-11-21 23:49:42', '2009-11-21', 'titulo teste', '2009-11-21 23:49:42', '2009-11-21', '2009-11-21', 'teste')

  def update
   @campanha = Campanha.find(params[:id])

   respond_to do |format|
     if @campanha.update_attributes(params[:campanha])
---
SELECT * FROM `campanhas` WHERE (`campanhas`.`id` = 1)
UPDATE `campanhas` SET `updated_at` = '2009-11-24 14:34:47', `titulo` = 'titulo aaaa' WHERE `id` = 1

  def destroy
   @campanha = Campanha.find(params[:id])
   @campanha.destroy
---
SELECT * FROM `campanhas` WHERE (`campanhas`.`id` = 6)
DELETE FROM `campanhas` WHERE `id` = 6