app/controllers/admin/campanhas_controller.rb

SELECT * FROM `campanhas` WHERE (`campanhas`.`id` = 2)
SELECT * FROM `produtos` ORDER BY nome
---
  def show
   @campanha = Campanha.find(params[:id])
   @produto = Produto.all