app/controllers/admin/vendedores_ranking_controller.rb

SELECT * FROM `vendedores_rankings`
---
  def index
    @vendedores_ranking = VendedoresRanking.all